---
kind: method
id: M:Autodesk.Revit.DB.Lighting.PointLightShape.#ctor
source: html/1025716c-c3f4-de34-8ac0-851ec115eb2c.htm
---
# Autodesk.Revit.DB.Lighting.PointLightShape.#ctor Method

Creates a point light shape object.

## Syntax (C#)
```csharp
public PointLightShape()
```